content/about.md
+++
title = "About"
author = ["Detlev Vandaele"]
lastmod = 2022-09-13T15:10:18+02:00
draft = false
weight = 2001
noauthor = true
nocomment = true
nodate = true
nopaging = true
noread = true
+++

## Me {#me}

I'm just an average, everyday software developer with too many things on his mind. <br/>
This blog is an attempt to get some of those things out of my mind, and onto a shareable medium. <br/>

Oh, and I love **Emacs**, but you'll figure that out as you read through my posts. <br/>

I am currently employed at [ **TomTom** ](https://www.tomtom.com/) as a Senior Software engineer, a great environment where I've had many opportunities to grow and learn over the years. <br/>


## My Experience {#my-experience}


### TomTom (2018 - present) {#tomtom--2018-present}

I started working as a fresh-out-of-school Software Engineer for TomTom in the autumn of 2018. <br/>

Throughout the years I have grown from a green, young developer, into a fully-fledged software engineer, embracing all of the aspects that come with developing **enterprise**, **production-ready** software for a number of projects: <br/>

-   I have gathered experience and expertise in **Java** and its JVM siblings, along with a slew of high quality, well-known frameworks and libraries such as **Spring (Boot)**, **Hibernate**, **RxJava**, etc. Some Python sprinkled on the side was never an exception either. <br/>

-   I've refined my operational and infrastructure skills by setting up, deploying and managing everything from a small AWS Lambda, to a **large-scale system of microservices** on both self-managed and cloud-managed **Kubernetes** services. <br/>

-   Software and tools such as Haschicorp's Terraform and Vault, Grafana, Prometheus, but also many of the managed services from cloud providers such as **Amazon AWS** and **Microsoft Azure** are no strangers to me. <br/>

-   At different points throughout my career, I have also come in contact with data-intensive applications, requiring me to build knowledge of Data Pipeline solutions like Apache's Airflow, as well as the wonderful world of Spark and its hosted runtime environments such as Databricks. <br/>

But most of all, I have learned what it means to be a **team player**. Great mentorship and amazing colleagues have elevated me to where I am today, and through the years I have had the honor to act as the Technical Lead of several amazing teams, applying the knowledge and experience they have thrust upon me. <br/>

I still learn everyday, if not more than when I was new; and I want to **keep on learning**. <br/>


## My Projects {#my-projects}

I am not extremely active in the Open Source community, for a lack of time, motivation and energy. <br/>

This blog is an attempt to give back bits and pieces of knowledge that I have gathered over many years, while also motivating myself to do more in this space. <br/>

Some minor things I have(n't) been working on are: <br/>

-   [newsa.gent](https://github.com/detvdl/newsa.gent) -- the source of this blog. Provides a sneak peek into draft/unpublished content, without the need for a Patreon subscription! <br/>
-   [cue-mode.el](https://github.com/detvdl/cue-mode.el) -- a minimal Emacs major mode for the [CUE configuration language](https://cuelang.org/) <br/>
-   [emacs.d](https://github.com/detvdl/emacs.d) -- my personal Emacs configuration. Caution: very disorganized and prone to mishaps! <br/>

Those, and any other (un)finished projects you can find over at my [GitHub profile](https://github.com/detvdl). <br/>